// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.


function getNumbers(min, max) {
    // Оголошуємо змінну sum для підрахунку суми парних чисел
    let sum = 0; 
  
    // Цикл від max до min за спаданням
    for (let i = max; i >= min; i--) {
      console.log(i); // Виводимо поточне i
  
      // Якщо число парне, додаємо його до sum
      if (i % 2 === 0) {
        sum += i;
      }
    }
  
    // Повертаємо суму усіх парних
    return sum;
  }