// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

const enterLogin = prompt("Enter your login");

// Перевіряємо, чи користувач взагалі щось ввів або натиснув Cancel
// (у такому разі значення буде `null` або порожній рядок)

if (enterLogin === null || enterLogin === "") {
  alert("Скасовано");
} else if (enterLogin === "Адмін") {
  // Якщо логін вірний, тоді запитуємо пароль
  const askPassword = prompt("Enter your password");
  
  // Знову перевіряємо: чи нічого не ввів або натиснув Cancel
  if (askPassword === null || askPassword === "") {
    alert("Скасовано");
  } else if (askPassword === "Я головний") {
    alert("Добрий день!");
  } else {
    alert("Невірний пароль!");
  }

} else {
  // Якщо логін взагалі не "Адмін"
  alert("Я вас не знаю");
}
